Campers_CC_Review/app/controllers/activities_controller.rb

    def index
        render json: Activity.all
---
SELECT "activities".* FROM "activities"

    def destroy
        find_activity.destroy
---
DELETE FROM "activities" WHERE "activities"."id" = ?  [["id", 1]]

    def find_activity
        Activity.find(params[:id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]