Campers_CC_Review/app/controllers/campers_controller.rb

    def index
        render json: Camper.all
---
SELECT "campers".* FROM "campers"

    def create
        new_camper = Camper.create!(camper_params)
---
INSERT INTO "campers" ("name", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Adam"], ["age", 17], ["created_at", "2022-03-03 16:45:27.482003"], ["updated_at", "2022-03-03 16:45:27.482003"]]

    def find_camper
        camper = Camper.find(params[:id])
---
SELECT "campers".* FROM "campers" WHERE "campers"."id" = ? LIMIT ?  [["id", 38383838383], ["LIMIT", 1]]