Campers_CC_Review/app/controllers/signups_controller.rb

    def create
        new_signup = Signup.create!(signup_params)
---
INSERT INTO "signups" ("time", "camper_id", "activity_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["time", 12], ["camper_id", 1], ["activity_id", 3], ["created_at", "2022-03-03 16:59:56.372016"], ["updated_at", "2022-03-03 16:59:56.372016"]]